Revit 2027 API
MEPAnalyticalSegment.EndNode Property
 The id of the end analytical node.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int EndNode { get; }
Public ReadOnly Property EndNode As Integer
	Get
public:
property int EndNode {
	int get ();
}
member EndNode : int with get
Property Value
Int32
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace